app/controllers/emails_controller.rb

  def create
    @email = Email.create(object: Faker::Book.title, body: Faker::Lorem.paragraphs, read: false)
---
INSERT INTO "emails" ("object", "body", "created_at", "updated_at", "read") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

def show
  @email = Email.find(params[:id])
  @email.update(read: true)
---
SELECT "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "emails" SET "updated_at" = $1, "read" = $2 WHERE "emails"."id" = $3  [["updated_at", "2023-06-01 17:12:16.433963"], ["read", true], ["id", 4]]

def update
  @email = Email.find(params[:id])
  @email.update(read:false)
---
SELECT "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "emails" SET "updated_at" = $1, "read" = $2 WHERE "emails"."id" = $3  [["updated_at", "2023-06-01 17:12:23.963942"], ["read", false], ["id", 1]]